app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-09-14 00:40:38.820698"], ["id", 1]]
---
  def update
    #raise params.inspect
    ##raise will cause the application to pauce and print out the params on an error page this way we are able to confirm the method is PATCH confirming it is set to update
      @article = Article.find(params[:id])
      @article.update(title: params[:article][:title], description: params[:article][:description])